app/Controllers/Data.php

UPDATE `data` SET `id` = '5', `nilai` = '5'
WHERE `data`.`id` IN ('5')
---
    public function create()
    {
        $datas = [
            'nilai' => $this->request->getVar('nilai')
        ];
        // $this->model->save($datas);
        if (!$this->model->save($datas)) {

DELETE FROM `data`
WHERE `id` IN ('1')
---
    public function delete($id = null)
    {
        $datas = $this->model->where('id', $id)->findAll();
        if ($datas) {
            $this->model->delete($id);