app/Models/ModelOtentikasi.php

SELECT *
FROM `otentikasi`
WHERE `email` = 'teknolabid@gmail.com'
 LIMIT 1
---
    function getEmail($email)
    {
        $builder = $this->table("otentikasi");
        $data = $builder->where("email", $email)->first();